In [1]:
import pandas as pd

In [2]:
df1 = pd.read_excel('C:/Users/emers/Downloads/Dio_Estudos/Primeiro_projeto_Dio_pandas/datasets/Aracaju.xlsx')
df2 = pd.read_excel('C:/Users/emers/Downloads/Dio_Estudos/Primeiro_projeto_Dio_pandas/datasets/Fortaleza.xlsx')
df3 = pd.read_excel('C:/Users/emers/Downloads/Dio_Estudos/Primeiro_projeto_Dio_pandas/datasets/Natal.xlsx')
df4 = pd.read_excel('C:/Users/emers/Downloads/Dio_Estudos/Primeiro_projeto_Dio_pandas/datasets/Recife.xlsx')
df5 = pd.read_excel('C:/Users/emers/Downloads/Dio_Estudos/Primeiro_projeto_Dio_pandas/datasets/Salvador.xlsx')

In [3]:
df = pd.concat([df1,df2,df3,df4,df5])

In [4]:
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [5]:
df.sample(10)

        Cidade       Data  Vendas  LojaID  Qtde
25   Fortaleza 2019-01-01   80.31    1004     4
12     Aracaju 2019-01-01    9.78    1520     8
33    Salvador 2019-01-01  144.19    1035     2
227      Natal 2019-01-02   14.70    1035     1
5      Aracaju 2018-01-01  156.20    1522     1
60      Recife 2019-01-01   37.97     983     1
145   Salvador 2019-01-02   84.62    1034     2
68   Fortaleza 2019-01-01   85.09    1005     6
151   Salvador 2019-01-02   14.63    1035     1
5        Natal 2019-03-30  674.00     854     2

In [6]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [7]:
df['LojaID'] = df['LojaID'].astype('object')# Se usa .astype() para definir a transformação

In [8]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [9]:
df.isnull().sum()# .isnull().sum() é para verificar se tem algum valor nulo se tiver e para retornar quantos e a onde

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [10]:
df['Vendas'].isnull().sum()

0

Para amapagar valor nulos usamos o comando (df.dropna(implace-True) e para especificar somente em qual coluna vc quer apagar os valores nulos segue o comando (df.dropna(subset=['Vendas'], implase=True)

In [11]:
df['Receitas'] = df['Vendas'].mul(df["Qtde"])

In [12]:
display(df)

       Cidade       Data  Vendas LojaID  Qtde  Receitas
0     Aracaju 2018-01-01  142.00   1520     1    142.00
1     Aracaju 2018-01-01   14.21   1522     6     85.26
2     Aracaju 2018-01-01   71.55   1520     1     71.55
3     Aracaju 2018-01-01    3.01   1521     7     21.07
4     Aracaju 2018-01-01   24.51   1522     8    196.08
..        ...        ...     ...    ...   ...       ...
235  Salvador 2019-01-03   41.84   1034     1     41.84
236  Salvador 2019-01-03  126.29   1035     3    378.87
237  Salvador 2019-01-03   38.06   1036     3    114.18
238  Salvador 2019-01-03  139.64   1035     1    139.64
239  Salvador 2019-01-03  161.41   1037     3    484.23

[894 rows x 6 columns]

In [13]:
df['Receitas'].max()

3544.0

In [14]:
df['Receitas'].min()

3.34

In [15]:
df.nlargest(3,'Receitas')#retorna qual voi a que teve maior receita

   Cidade       Data  Vendas LojaID  Qtde  Receitas
7   Natal 2019-03-18   886.0    853     4    3544.0
51  Natal 2018-01-21   859.0    852     4    3436.0
55  Natal 2019-01-08   859.0    854     4    3436.0

In [16]:
df.nsmallest(3, 'Receitas')

      Cidade       Data  Vendas LojaID  Qtde  Receitas
118  Aracaju 2018-01-01    3.34   1522     1      3.34
65    Recife 2019-01-01    4.01    981     1      4.01
92     Natal 2019-01-02    4.57   1035     1      4.57

In [17]:
df.groupby('Cidade')['Receitas'].sum()# Mostou a cidade e raceita de cada uma

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receitas, dtype: float64

In [18]:
df.sort_values('Receitas',ascending=False).head(10)# retorna as 10 receitas mais altas

   Cidade       Data  Vendas LojaID  Qtde  Receitas
7   Natal 2019-03-18   886.0    853     4    3544.0
55  Natal 2019-01-08   859.0    854     4    3436.0
51  Natal 2018-01-21   859.0    852     4    3436.0
30  Natal 2018-10-02   856.0    853     4    3424.0
41  Natal 2018-05-20   835.0    852     4    3340.0
38  Natal 2018-02-25   828.0    852     4    3312.0
10  Natal 2018-10-27   828.0    852     4    3312.0
69  Natal 2019-03-24   817.0    852     4    3268.0
62  Natal 2018-02-10   793.0    854     4    3172.0
52  Natal 2018-04-27   778.0    854     4    3112.0

In [19]:
df['Data'] = df['Data'].astype('int64')

In [20]:
df.dtypes

Cidade       object
Data          int64
Vendas      float64
LojaID       object
Qtde          int64
Receitas    float64
dtype: object

In [21]:
df['Data'] = pd.to_datetime(df['Data'])#Mudando para o formato de data

In [22]:
df.dtypes

Cidade              object
Data        datetime64[ns]
Vendas             float64
LojaID              object
Qtde                 int64
Receitas           float64
dtype: object